app/views/pagos/_form.html.erb

SELECT "rentas".* FROM "rentas"  ORDER BY "rentas"."inquilino_id" ASC
---
                    <div class="form-group col-md-12">
                      <%= f.association :rentas , :collection => rentas_activas.order(:inquilino_id),  input_html: {class: "pais form-control"}%>