app/views/pagos/_list.html.erb

SELECT "pagos".* FROM "pagos" WHERE "pagos"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "pagos" WHERE "pagos"."user_id" = ?  [["user_id", 1]]
---
    <ul class="nav nav-tabs">
        <span class="pull-right small text-muted">Tienes <%=current_user.pagos.count%> Pagos</span>