app/views/inquilinos/_list.html.erb

SELECT "inquilinos".* FROM "inquilinos" WHERE "inquilinos"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "inquilinos" WHERE "inquilinos"."user_id" = ?  [["user_id", 1]]
---
    <ul class="nav nav-tabs">
        <li class="active"><a data-toggle="tab" href="#tab-1"><i class="fa fa-user"></i> Inquilinos(<%=@inquilinos.count%>)</a></li>