app/views/rentas/_form.html.erb

                      <div class="col-md-4">
                        <%= f.select :inquilino, options_from_collection_for_select(current_user.inquilinos.order(:nombre).all, "id", "nombre", params[:inquilino]), {}, class: "pais form-control" %>
---
SELECT "inquilinos".* FROM "inquilinos" WHERE "inquilinos"."user_id" = ?  ORDER BY "inquilinos"."nombre" ASC  [["user_id", 1]]

                      <div class="col-md-4">
                        <%= f.select :propiedad, options_from_collection_for_select(current_user.propiedads.order(:nombre).all, "id", "idnt" , params[:propiedad]), {}, class: "pais form-control" %>
---
SELECT "propiedads".* FROM "propiedads" WHERE "propiedads"."user_id" = ?  ORDER BY "propiedads"."nombre" ASC  [["user_id", 1]]