app/views/rentas/new.html.erb

                    <h4 class="rentas_inquilino">O seleciona un inquilino existente y haz click en "next"<h4/>
                    <%= f.association :inquilino, :collection =>current_user.inquilinos.order(:nombre).all,  input_html: {class: "pais form-control width100"}%>
---
SELECT "inquilinos".* FROM "inquilinos" WHERE "inquilinos"."user_id" = ?  ORDER BY "inquilinos"."nombre" ASC  [["user_id", 1]]

                      <h4 class="rentas_propiedad">o Seleciona una propiedad existente y haz click en "next"<h4/>
                        <%= f.association  :propiedad, :collection =>current_user.propiedads.order(:nombre).all,  input_html: {class: "pais2 form-control", style: "width: 100%"}%>
---
SELECT "propiedads".* FROM "propiedads" WHERE "propiedads"."user_id" = ?  ORDER BY "propiedads"."nombre" ASC  [["user_id", 1]]