app/controllers/inquilinos_controller.rb

SELECT "inquilinos".* FROM "inquilinos" WHERE "inquilinos"."user_id" = ?  [["user_id", 4]]
SELECT MAX("inquilinos"."updated_at") FROM "inquilinos" WHERE "inquilinos"."user_id" = ?  [["user_id", 4]]
---
  def index
    @inquilinos = current_user.inquilinos.all

INSERT INTO "inquilinos" ("nombre", "nacimiento", "nacionalidad", "curp", "rfc", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @inquilino = Inquilino.new(inquilino_params)
    @inquilino.user = current_user
    if @inquilino.save

UPDATE "inquilinos" SET "nombre" = ?, "nacimiento" = ?, "updated_at" = ? WHERE "inquilinos"."id" = ?  [["nombre", "Ron Sampson"], ["nacimiento", "2017-08-08"], ["updated_at", "2017-09-01 00:32:09.959451"], ["id", 3]]
---
  def update
    if @inquilino.update(inquilino_params)

SELECT "inquilinos".* FROM "inquilinos" WHERE (nombre like '%Luis%')
---
  def search
    @inq = Inquilino.search(params[:search_param])

DELETE FROM "inquilinos" WHERE "inquilinos"."id" = ?  [["id", 1]]
---
  def destroy
    @inquilino.destroy

SELECT  "inquilinos".* FROM "inquilinos" WHERE "inquilinos"."id" = ? LIMIT 1  [["id", 42]]
---
  def set_inquilino
    @inquilino= Inquilino.find(params[:id])