app/controllers/pagos_controller.rb

  def index
    @pagos = current_user.pagos.where("pagos.pagado = ?", true)
---
SELECT "pagos".* FROM "pagos" WHERE "pagos"."user_id" = ?  [["user_id", 1]]
SELECT MAX("pagos"."updated_at") FROM "pagos" WHERE "pagos"."user_id" = ?  [["user_id", 1]]

  def create
    @pago = Pago.new(pago_params)
    @pago.user = current_user
    if @pago.save
---
INSERT INTO "pagos" ("monto", "fecha", "rentas_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["monto", 27000], ["fecha", "2017-09-26"], ["rentas_id", 1], ["user_id", 1], ["created_at", "2017-09-08 16:32:16.162187"], ["updated_at", "2017-09-08 16:32:16.162187"]]

  def set_pago
    @pago= Pago.find(params[:id])
---
SELECT  "pagos".* FROM "pagos" WHERE "pagos"."id" = ? LIMIT 1  [["id", 3]]