app/controllers/propiedads_controller.rb

SELECT "propiedads".* FROM "propiedads" WHERE "propiedads"."user_id" = ?  [["user_id", 5]]
SELECT MAX("propiedads"."updated_at") FROM "propiedads" WHERE "propiedads"."user_id" = ?  [["user_id", 5]]
---
  def index
    @propiedads = current_user.propiedads.all

INSERT INTO "propiedads" ("nombre", "calle", "colonia", "municipio", "numero", "numeroe", "cp", "estado", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @propiedad = Propiedad.new(propiedad_params)
    @propiedad.user = current_user
    if @propiedad.save

UPDATE "propiedads" SET "calle" = ?, "updated_at" = ? WHERE "propiedads"."id" = ?  [["calle", "Avenida de los Laureles"], ["updated_at", "2017-09-01 16:00:43.617462"], ["id", 2]]
---
  def update
    if @propiedad.update(propiedad_params)

SELECT "propiedads".* FROM "propiedads" WHERE (nombre like '%bosques%')
---
  def search
    @pro = Propiedad.search(params[:search_param])

DELETE FROM "propiedads" WHERE "propiedads"."id" = ?  [["id", 1]]
---
  def destroy
    @propiedad.destroy

SELECT  "propiedads".* FROM "propiedads" WHERE "propiedads"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_propiedad
    @propiedad= Propiedad.find(params[:id])