app/controllers/rentas_controller.rb

SELECT  "rentas".* FROM "rentas" WHERE "rentas"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT MAX("rentas"."updated_at") FROM "rentas" WHERE "rentas"."user_id" = ?  [["user_id", 1]]
---
  def index
    @rentas = current_user.rentas.all

INSERT INTO "inquilinos" ("nombre", "nacimiento", "nacionalidad", "curp", "rfc", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "propiedads" ("nombre", "calle", "colonia", "municipio", "numero", "numeroe", "cp", "estado", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "rentas" ("costo", "inicio", "inquilino_id", "propiedad_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["costo", 1222], ["inicio", "2017-07-09"], ["inquilino_id", 1], ["propiedad_id", 1], ["user_id", 1], ["created_at", "2017-09-03 00:45:47.139042"], ["updated_at", "2017-09-03 00:45:47.139042"]]
---
  def create
    @renta = Rentas.new(renta_params)
    if !params[:rentas][:inquilino_id].present?
      inquilino = Inquilino.new(inquilino_params)
      inquilino.user = current_user
      inquilino.save
      @renta.inquilino = inquilino
    end
    if !params[:rentas][:propiedad_id].present?
      propiedad = Propiedad.new(propiedad_params)
      propiedad.user = current_user
      propiedad.save
      @renta.propiedad = propiedad
    end
    @renta.user = current_user

    if @renta.save

UPDATE "rentas" SET "final" = ?, "inicio" = ?, "updated_at" = ? WHERE "rentas"."id" = ?  [["final", "2017-03-31"], ["inicio", "2017-09-20"], ["updated_at", "2017-09-05 23:57:55.225320"], ["id", 8]]
---
  def update
    tmp = @renta.final
    time = Time.now

    if @renta.update(renta_params)

DELETE FROM "rentas" WHERE "rentas"."id" = ?  [["id", 3]]
---
  def destroy
    # borrar pagos
    @renta.destroy

SELECT  "rentas".* FROM "rentas" WHERE "rentas"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_renta
    @renta = Rentas.find(params[:id])